app/Controllers/Barang.php

INSERT INTO `transaksi` (`id_pembeli`, `id_barang`, `status`) VALUES ('7', '13', 'keranjang')
---
    public function tambahKeKeranjang($id_barang)
    {
        $email = !empty(user()->email) ? user()->email : null;
        // Mendapatkan informasi barang dari database berdasarkan id_barang
        // $barang = $this->barangModel->getDetailBarang($id_barang);
        $profil = $this->pembeli->getProfil($email);
        $id_pembeli = $profil['id_pembeli'];
        $status = "keranjang";
        $jumlah_barang = 1;

        // Menambahkan data ke tabel transaksi (keranjang)
        $data = [
            'id_pembeli' => $id_pembeli,
            'id_barang' => $id_barang,
            'jumlah_barang' => $jumlah_barang, // Jumlah barang diatur menjadi 1
            'total_harga' => 0, // Total harga diisi saat checkout
            'tanggal_beli' => null, // Tanggal beli diisi saat checkout
            'status' => $status
        ];
        $this->transaksiModel->insert($data);