app/Models/BarangModel.php

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`slug`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`updated_at`, `toko`.`nama_toko`, `toko`.`id_toko`
FROM `barang`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
ORDER BY `barang`.`nama_barang` ASC
---
    public function getDaftarBarang()
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.slug, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang,barang.updated_at, toko.nama_toko, toko.id_toko')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->orderBy('barang.nama_barang', 'ASC')
            ->get()
            ->getResultArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`slug`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`updated_at`, `toko`.`nama_toko`, `toko`.`id_toko`, `kategori`.`kategori`
FROM `barang`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
JOIN `kategori` ON `barang`.`id_kategori` = `kategori`.`id_kategori`
WHERE `barang`.`id_kategori` = '1'
ORDER BY `barang`.`nama_barang` ASC
---
    public function getDaftarBarangKategori($id_kategori)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.slug, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang,barang.updated_at, toko.nama_toko, toko.id_toko, kategori.kategori')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->join('kategori', 'barang.id_kategori = kategori.id_kategori')
            ->where('barang.id_kategori', $id_kategori)
            ->orderBy('barang.nama_barang', 'ASC')
            ->get()
            ->getResultArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`id_kategori`, `barang`.`updated_at`, `toko`.`nama_toko`, `toko`.`id_toko`
FROM `barang`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
WHERE `toko`.`id_kecamatan` = '1'
ORDER BY `barang`.`harga`
---
    public function getBarangRekomendasi($id_kecamatan)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang, barang.id_kategori, barang.updated_at, toko.nama_toko, toko.id_toko')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->where('toko.id_kecamatan', $id_kecamatan)
            ->orderBy('barang.harga')
            ->get()
            ->getResultArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`slug`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`id_kategori`, `barang`.`updated_at`, `toko`.`nama_toko`, `toko`.`foto_toko`, `toko`.`detail_alamat`, `kecamatan`.`nama_kecamatan`, `desa`.`nama_desa`
FROM `barang`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
JOIN `kecamatan` ON `toko`.`id_kecamatan` = `kecamatan`.`id_kecamatan`
JOIN `desa` ON `toko`.`id_desa` = `desa`.`id_desa`
WHERE `toko`.`id_toko` = '5'
---
    public function getDetailToko($id_toko)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.slug, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang, barang.id_kategori, barang.updated_at, toko.nama_toko, toko.foto_toko, toko.detail_alamat, kecamatan.nama_kecamatan, desa.nama_desa')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->join('kecamatan', 'toko.id_kecamatan = kecamatan.id_kecamatan')
            ->join('desa', 'toko.id_desa = desa.id_desa')
            ->where('toko.id_toko', $id_toko)
            ->get()
            ->getResultArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`id_kategori`, `barang`.`updated_at`, `toko`.`id_toko`, `toko`.`nama_toko`, `toko`.`foto_toko`
FROM `barang`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
WHERE `barang`.`id_barang` = '13'
---
    public function getDetailBarang($id_barang)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang, barang.id_kategori, barang.updated_at, toko.id_toko, toko.nama_toko, toko.foto_toko')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->where('barang.id_barang', $id_barang)
            ->get()
            ->getRowArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`id_kategori`, `barang`.`updated_at`, `toko`.`id_toko`, `toko`.`nama_toko`, `toko`.`foto_toko`, `kategori`.`id_kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori` = `kategori`.`id_kategori`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
WHERE `barang`.`id_kategori` = '1'
---
    public function getBarangRekomendasiSejenis($id_kategori)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang, barang.id_kategori, barang.updated_at, toko.id_toko, toko.nama_toko, toko.foto_toko, kategori.id_kategori')
            ->join('kategori', 'barang.id_kategori = kategori.id_kategori')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->where('barang.id_kategori', $id_kategori)
            ->get()
            ->getResultArray();

SELECT `barang`.`nama_barang`, `barang`.`id_barang`, `barang`.`harga`, `barang`.`stock`, `barang`.`deskripsi`, `barang`.`foto_barang`, `barang`.`id_kategori`, `barang`.`updated_at`, `toko`.`id_toko`, `toko`.`nama_toko`, `toko`.`foto_toko`, `kategori`.`id_kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori` = `kategori`.`id_kategori`
JOIN `toko` ON `barang`.`id_toko` = `toko`.`id_toko`
WHERE `barang`.`id_toko` = '5'
---
    public function getBarangRekomendasiToko($id_toko)
    {
        return $this->db->table('barang')
            ->select('barang.nama_barang, barang.id_barang, barang.harga, barang.stock, barang.deskripsi, barang.foto_barang, barang.id_kategori, barang.updated_at, toko.id_toko, toko.nama_toko, toko.foto_toko, kategori.id_kategori')
            ->join('kategori', 'barang.id_kategori = kategori.id_kategori')
            ->join('toko', 'barang.id_toko = toko.id_toko')
            ->where('barang.id_toko', $id_toko)
            ->get()
            ->getResultArray();